configurations/WebformulierenVerwerker/webcontent/GeneriekeFormulierAfhandeling.wsdl

<?xml version='1.0' encoding='utf-8' ?><wsdl:definitions name="GeneriekeFormulierAfhandeling" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<wsdl:types>
		<xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
			<xs:element name="Version">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="version" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="VersionResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="VersionResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="Info">
				<xs:complexType>
					<xs:sequence/>
				</xs:complexType>
			</xs:element>
			<xs:element name="InfoResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="InfoResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="maakInkomendDocumentregistratie">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="vertrouwelijkheid" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="onderwerp" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="behandelaarnaam" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="inhoud" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="afzenderbsn" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="maakInkomendDocumentregistratieResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="maakInkomendDocumentregistratieResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="bewaarDocument">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="registratieIdentificatie" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filename" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filedata" nillable="true" type="xs:base64Binary"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="bewaarDocumentResponse">
				<xs:complexType>
					<xs:sequence/>
				</xs:complexType>
			</xs:element>
			<xs:element name="opslaanInkNatuurlijkPersoon">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="afzenderbsn" nillable="false" type="xs:string"/>
						<xs:element minOccurs="0" name="vertrouwelijkheid" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="behandelaarnaam" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="onderwerp" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="inhoud" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filename" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filedata" nillable="true" type="xs:base64Binary"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="opslaanInkNatuurlijkPersoonResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="opslaanInkNatuurlijkPersoonResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="opslaanInkNietNatuurlijkPersoon">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="afzenderkvk" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="vertrouwelijkheid" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="behandelaarnaam" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="onderwerp" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="inhoud" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filename" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filedata" nillable="true" type="xs:base64Binary"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="opslaanInkNietNatuurlijkPersoonResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="opslaanInkNietNatuurlijkPersoonResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="opslaanBijlage">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="registratienummer" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filename" nillable="true" type="xs:string"/>
						<xs:element minOccurs="0" name="filedata" nillable="true" type="xs:base64Binary"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
			<xs:element name="opslaanBijlageResponse">
				<xs:complexType>
					<xs:sequence>
						<xs:element minOccurs="0" name="opslaanBijlageResult" nillable="true" type="xs:string"/>
					</xs:sequence>
				</xs:complexType>
			</xs:element>
		</xs:schema>
		<xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
			<xs:element name="anyType" nillable="true" type="xs:anyType"/>
			<xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
			<xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
			<xs:element name="boolean" nillable="true" type="xs:boolean"/>
			<xs:element name="byte" nillable="true" type="xs:byte"/>
			<xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
			<xs:element name="decimal" nillable="true" type="xs:decimal"/>
			<xs:element name="double" nillable="true" type="xs:double"/>
			<xs:element name="float" nillable="true" type="xs:float"/>
			<xs:element name="int" nillable="true" type="xs:int"/>
			<xs:element name="long" nillable="true" type="xs:long"/>
			<xs:element name="QName" nillable="true" type="xs:QName"/>
			<xs:element name="short" nillable="true" type="xs:short"/>
			<xs:element name="string" nillable="true" type="xs:string"/>
			<xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
			<xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
			<xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
			<xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
			<xs:element name="char" nillable="true" type="tns:char"/>
			<xs:simpleType name="char">
				<xs:restriction base="xs:int"/>
			</xs:simpleType>
			<xs:element name="duration" nillable="true" type="tns:duration"/>
			<xs:simpleType name="duration">
				<xs:restriction base="xs:duration">
					<xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
					<xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
					<xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:element name="guid" nillable="true" type="tns:guid"/>
			<xs:simpleType name="guid">
				<xs:restriction base="xs:string">
					<xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
				</xs:restriction>
			</xs:simpleType>
			<xs:attribute name="FactoryType" type="xs:QName"/>
			<xs:attribute name="Id" type="xs:ID"/>
			<xs:attribute name="Ref" type="xs:IDREF"/>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_Version_InputMessage">
		<wsdl:part name="parameters" element="tns:Version"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_Version_OutputMessage">
		<wsdl:part name="parameters" element="tns:VersionResponse"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_Info_InputMessage">
		<wsdl:part name="parameters" element="tns:Info"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_Info_OutputMessage">
		<wsdl:part name="parameters" element="tns:InfoResponse"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_maakInkomendDocumentregistratie_InputMessage">
		<wsdl:part name="parameters" element="tns:maakInkomendDocumentregistratie"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_maakInkomendDocumentregistratie_OutputMessage">
		<wsdl:part name="parameters" element="tns:maakInkomendDocumentregistratieResponse"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_bewaarDocument_InputMessage">
		<wsdl:part name="parameters" element="tns:bewaarDocument"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_bewaarDocument_OutputMessage">
		<wsdl:part name="parameters" element="tns:bewaarDocumentResponse"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_opslaanInkNatuurlijkPersoon_InputMessage">
		<wsdl:part name="parameters" element="tns:opslaanInkNatuurlijkPersoon"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_opslaanInkNatuurlijkPersoon_OutputMessage">
		<wsdl:part name="parameters" element="tns:opslaanInkNatuurlijkPersoonResponse"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_opslaanInkNietNatuurlijkPersoon_InputMessage">
		<wsdl:part name="parameters" element="tns:opslaanInkNietNatuurlijkPersoon"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_opslaanInkNietNatuurlijkPersoon_OutputMessage">
		<wsdl:part name="parameters" element="tns:opslaanInkNietNatuurlijkPersoonResponse"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_opslaanBijlage_InputMessage">
		<wsdl:part name="parameters" element="tns:opslaanBijlage"/>
	</wsdl:message>
	<wsdl:message name="IGeneriekeFormulierAfhandeling_opslaanBijlage_OutputMessage">
		<wsdl:part name="parameters" element="tns:opslaanBijlageResponse"/>
	</wsdl:message>
	<wsdl:portType name="IGeneriekeFormulierAfhandeling">
		<wsdl:operation name="Version">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/Version" message="tns:IGeneriekeFormulierAfhandeling_Version_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/VersionResponse" message="tns:IGeneriekeFormulierAfhandeling_Version_OutputMessage"/>
		</wsdl:operation>
		<wsdl:operation name="Info">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/Info" message="tns:IGeneriekeFormulierAfhandeling_Info_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/InfoResponse" message="tns:IGeneriekeFormulierAfhandeling_Info_OutputMessage"/>
		</wsdl:operation>
		<wsdl:operation name="maakInkomendDocumentregistratie">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/maakInkomendDocumentregistratie" message="tns:IGeneriekeFormulierAfhandeling_maakInkomendDocumentregistratie_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/maakInkomendDocumentregistratieResponse" message="tns:IGeneriekeFormulierAfhandeling_maakInkomendDocumentregistratie_OutputMessage"/>
		</wsdl:operation>
		<wsdl:operation name="bewaarDocument">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/bewaarDocument" message="tns:IGeneriekeFormulierAfhandeling_bewaarDocument_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/bewaarDocumentResponse" message="tns:IGeneriekeFormulierAfhandeling_bewaarDocument_OutputMessage"/>
		</wsdl:operation>
		<wsdl:operation name="opslaanInkNatuurlijkPersoon">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanInkNatuurlijkPersoon" message="tns:IGeneriekeFormulierAfhandeling_opslaanInkNatuurlijkPersoon_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanInkNatuurlijkPersoonResponse" message="tns:IGeneriekeFormulierAfhandeling_opslaanInkNatuurlijkPersoon_OutputMessage"/>
		</wsdl:operation>
		<wsdl:operation name="opslaanInkNietNatuurlijkPersoon">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanInkNietNatuurlijkPersoon" message="tns:IGeneriekeFormulierAfhandeling_opslaanInkNietNatuurlijkPersoon_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanInkNietNatuurlijkPersoonResponse" message="tns:IGeneriekeFormulierAfhandeling_opslaanInkNietNatuurlijkPersoon_OutputMessage"/>
		</wsdl:operation>
		<wsdl:operation name="opslaanBijlage">
			<wsdl:input wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanBijlage" message="tns:IGeneriekeFormulierAfhandeling_opslaanBijlage_InputMessage"/>
			<wsdl:output wsaw:Action="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanBijlageResponse" message="tns:IGeneriekeFormulierAfhandeling_opslaanBijlage_OutputMessage"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="BasicHttpBinding_IGeneriekeFormulierAfhandeling" type="tns:IGeneriekeFormulierAfhandeling">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="Version">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/Version" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="Info">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/Info" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="maakInkomendDocumentregistratie">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/maakInkomendDocumentregistratie" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="bewaarDocument">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/bewaarDocument" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="opslaanInkNatuurlijkPersoon">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanInkNatuurlijkPersoon" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="opslaanInkNietNatuurlijkPersoon">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanInkNietNatuurlijkPersoon" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="opslaanBijlage">
			<soap:operation soapAction="http://tempuri.org/IGeneriekeFormulierAfhandeling/opslaanBijlage" style="document"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
    <!--
	<wsdl:service name="GeneriekeFormulierAfhandeling">
		<wsdl:port name="BasicHttpBinding_IGeneriekeFormulierAfhandeling" binding="tns:BasicHttpBinding_IGeneriekeFormulierAfhandeling">
			<soap:address location="http://localhost:59830/corsakoppeling/GeneriekeFormulierAfhandeling.svc"/>
		</wsdl:port>
	</wsdl:service>
    -->
	<wsdl:service name="GeneriekeFormulierAfhandeling">
		<wsdl:port name="BasicHttpBinding_IGeneriekeFormulierAfhandeling" binding="tns:BasicHttpBinding_IGeneriekeFormulierAfhandeling">
        <!-- Request AbsoluteUri: http://testtsjinstbus.sudwestfryslan.nl:8081/corsakoppeling/GeneriekeFormulierAfhandeling.wsdl.aspx -->
        <!-- Request Opgebouwd: http://testtsjinstbus.sudwestfryslan.nl:8081//corsakoppeling/GeneriekeFormulierAfhandeling.wsdl.aspx -->
        
            <!-- contains tsjinstbus -->
       <!-- <soap:address location="https://testtsjinstbus.sudwestfryslan.nl/corsakoppeling/GeneriekeFormulierAfhandeling.svc"/> -->
            <soap:address location="https://testtsjinstbus.sudwestfryslan.nl/webformulierenverwerker/services/WebformulierenVerwerker"/>
        >
        </wsdl:port>
  </wsdl:service>	
</wsdl:definitions>