tests/WebformulierenVerwerker/scenario06/KodisonBijlageRequest.xml

<soap:Envelope xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap:Body>
    <bct:opslaanBijlage xmlns:bct='http://tempuri.org/'>
<!-- optional -->
<!-- This element may be left empty if xsi:nil='true' is set. -->
      <bct:registratienummer>12345</bct:registratienummer>
         <!--Optional:-->
         <bct:filename>abc.txt</bct:filename>
         <!--Optional:-->
         <bct:filedata></bct:filedata>
    </bct:opslaanBijlage>
  </soap:Body>
</soap:Envelope>
